opends/tests/functional-tests/shared/data/dsml/suites/07srchsuite/data/srch025.dat

POST /dsml HTTP/1.1
Host: Foo
Connection: Close
Content-Length: 904
SOAPAction: "#batchRequest"

<?xml version='1.0' encoding='UTF-8'?>
  <soap-env:Envelope
      xmlns:xsd='http://www.w3.org/2001/XMLSchema'
      xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
      xmlns:soap-env='http://schemas.xmlsoap.org/soap/envelope/'>
    <soap-env:Body>
      <batchRequest xmlns="urn:oasis:names:tc:DSML:2:0:core">
        <searchRequest dn="o=IMC, c=US" scope="wholeSubtree" timeLimit="1" derefAliases="neverDerefAliases">
        <filter>
		<or>
        		<substrings name="sn">
        			<initial>B</initial>
        			<final>s</final>
        		</substrings>
        		<substrings name="cn">
        			<initial>T</initial>
        			<final>k</final>
        		</substrings>
        		<equalityMatch name="title">
        			<value>dictator</value>
        		</equalityMatch>
		</or>
        </filter>
        </searchRequest>
      </batchRequest>
    </soap-env:Body>
  </soap-env:Envelope>
